Revit 2026 API

# ElectricalSystemBalancedLoad Property

---

Reports whether the BalancedLoad is on or off.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool BalancedLoad { get; }
```
```vb
Public ReadOnly Property BalancedLoad As Boolean
	Get
```
```cpp
public:
property bool BalancedLoad {
	bool get ();
}
```
```fsharp
member BalancedLoad : bool with get
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the BalancedLoad value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace